blog/engineering.protoverse.project.org
** From Metaphysics to Code

The primary langage used for building the model should enable to express the fundamental dynamics as closely and naturally as possible in order to minimize context-switching. So what are we looking for?

First of all, we might want the language that is concise and clean; resource allocation should be abstracted away, so no manual memory management, but also no explicit management of concurrent and parallel execution, as far as possible.

It must lend itself to high-level abstractions, and various sorts of abstractions too; e.g. [[https://en.wikipedia.org/wiki/Metalinguistic_abstraction][metalinguistic abstraction]] -- because it seems quite unlikely to achieve a close fit of metaphysics and code with a general-purpose programming language alone, but rather to design and implement a DSL (that may resemble some form of process calculus, for instance).

Certain programming paradigms seem to fit, so it would be nice to have access to [[https://en.wikipedia.org/wiki/Purely_functional_programming][functional programming]], [[https://en.wikipedia.org/wiki/Logic_programming][logic programming]], [[https://en.wikipedia.org/wiki/Dataflow_programming][dataflow programming]] and [[https://en.wikipedia.org/wiki/Language-oriented_programming][language-oriented programming]] powered by metaprogramming (via macros, as they are useful for many things).

There will be no distinct formal specification of the Protoverse model (or put differently, the code will be the specification), hence an exploratory programming style seems like the sanest approach to model the Protoverse dynamics. That sets the focus on primarily interactive use of a language or computing environment.

Pivoting quickly into different directions must be feasible, so we also want an emphasis on refactoring capabilities.

** Prototyping / Conversational Programming

The benefit hinges on the anticipated modus operandi of the Protoverse:

- Batch-processing: This approach would make live-coding abilities not a requirement. We would be free to compile down to machine code and use a statically typed language, where the strict distinction between programming time, compile time and run time wouldn't be a hindrance.
- Long-running: The Protoverse as an application that reconfigures itself continuosly leans inherently towards being stateful. It calls for interaction and live-coding at the running system as the primary way of development and maintenance.

The help of a VM- or image-based runtime and language that allows to experiment with the system and to tweak it at runtime would greatly enhance understanding and development efficiency. Unfortunately, this rules out statically typed languages because of their sharp distinctions between programming time, compile time and run time.

Since I asssume the more interesting stuff is likely to happen the longer the Protoverse runs, the ability to step back and forth through the execution history might be desired, too (straightforward state-recreation, or actually circumventing the need for state recreation to begin with).

Prototyping-friendly also means predictable and well-balanced execution profile of the runtime, that doesn't chug on un-optimized and naive ad-hoc code -- e.g. huge data structures, heavy allocation or deep recursion.

** Massively Interacting Computation

A lot of stuff is going to happen in realtime. Eventually I'm expecting many billions of smallish, interacting computations. In the early stages, where the focus is on modelling the Process abstraction and dynamics, the capacity to handle a couple of millions might be enough, which should be achievable in the cloud, on a small Rasperry Pi cluster or even a bunch of laptops.

Before we come to concurrency and parallelism: the concepts are often mixed up, and understandably so -- [[https://wiki.haskell.org/index.php?title=Parallelism_vs._Concurrency][here's an explanation]] and [[https://www.classes.cs.uchicago.edu/archive/2017/spring/22300-1/lectures/ConcurrencyParallelism/ConcurrencyParallelism.pdf][here]].

The crux with current architectures is that parallelism is tied to the number of /physical/ cores available. Regular CPUs have a dozen up to a couple of dozen cores, GPUs around 16,000 cores. The ideal thing to have would be something like "real-time-soft-scalable" parallelism, but in practical terms with current architecture we need both, the "normal" interleaving or time-slicing concurrency and true parallelism.

*** Concurrency

Since /massive/ concurrency is a basic need (dealing with a lot of things), this will practically rule out concurrency solely based on "heavyweight" kernel threads.

There are basically two facilities in common use that fit massive concurrency: Either [[https://en.wikipedia.org/wiki/Actor_model][actors]] (the Erlang model) or CSP-style channels (the Golang model) -- [[https://wingolog.org/archives/2016/10/12/an-incomplete-history-of-language-facilities-for-concurrency][breakdown here]].

My first naive idea was to map primitive Protoverse Processes and runtime threads one-to-one, where the runtime threads are scheduled by a runtime and multiplexed to kernel threads.

Here is to note that Protoverse Processes compose into higher-order Processes, which means that way higher-order Protoverse Processes would get automatically more "computational power" (however, the "power" won't increase entirely linear, of course -- there'll be communication overhead, amongst other factors).

However, to model Protoverse Processes (the "Entities" so to speak) as runtime threads/processes (e.g. lightweight threads or whatever) may lead to scaling issues pretty quickly, so it would rather make more sense to decouple both and model Protoverse Processes as /data/ instead, and use (ephemeral) runtime processes as an abstracted-away layer that merely "carries" or "supports" their interactions.

