blog/engineering.protoverse.project.html
<div id="outline-container-org2135ed3" class="outline-3">
<h3 id="org2135ed3"><a href="#org2135ed3">From Metaphysics to Code</a></h3>
<div class="outline-text-3" id="text-org2135ed3">
<p>
The primary langage used for building the model should enable to express the fundamental dynamics as closely and naturally as possible in order to minimize context-switching. So what are we looking for?<br>
</p>

<p>
First of all, we might want the language that is concise and clean; resource allocation should be abstracted away, so no manual memory management, but also no explicit management of concurrent and parallel execution, as far as possible.<br>
</p>

<p>
It must lend itself to high-level abstractions, and various sorts of abstractions too; e.g. <a href="https://en.wikipedia.org/wiki/Metalinguistic_abstraction">metalinguistic abstraction</a> &#x2013; because it seems quite unlikely to achieve a close fit of metaphysics and code with a general-purpose programming language alone, but rather to design and implement a DSL (that may resemble some form of process calculus, for instance).<br>
</p>

<p>
Certain programming paradigms seem to fit, so it would be nice to have access to <a href="https://en.wikipedia.org/wiki/Purely_functional_programming">functional programming</a>, <a href="https://en.wikipedia.org/wiki/Logic_programming">logic programming</a>, <a href="https://en.wikipedia.org/wiki/Dataflow_programming">dataflow programming</a> and <a href="https://en.wikipedia.org/wiki/Language-oriented_programming">language-oriented programming</a> powered by metaprogramming (via macros, as they are useful for many things).<br>
</p>

<p>
There will be no distinct formal specification of the Protoverse model (or put differently, the code will be the specification), hence an exploratory programming style seems like the sanest approach to model the Protoverse dynamics. That sets the focus on primarily interactive use of a language or computing environment.<br>
</p>

<p>
Pivoting quickly into different directions must be feasible, so we also want solid refactoring capabilities.<br>
</p>
</div>
</div>
<div id="outline-container-orgc2bd503" class="outline-3">
<h3 id="orgc2bd503"><a href="#orgc2bd503">Prototyping / Conversational Programming</a></h3>
<div class="outline-text-3" id="text-orgc2bd503">
<p>
The benefit hinges on the anticipated modus operandi of the Protoverse:<br>
</p>

<ul class="org-ul">
<li>Batch-processing: This approach would make live-coding abilities not a requirement. We would be free to compile down to machine code and use a statically typed language, where the strict distinction between programming time, compile time and run time wouldn&rsquo;t be a hindrance.<br></li>
<li>Long-running: The Protoverse as an application that reconfigures itself continuosly leans inherently towards being stateful. It calls for interaction and live-coding at the running system as the primary way of development and maintenance.<br></li>
</ul>

<p>
The help of a VM- or image-based runtime and language that allows to experiment with the system and to tweak it at runtime would greatly enhance understanding and development efficiency. Unfortunately, this rules out statically typed languages because of their sharp distinctions between programming time, compile time and run time.<br>
</p>

<p>
Since I asssume the more interesting stuff is likely to happen the longer the Protoverse runs, the ability to step back and forth through the execution history might be desired, too (straightforward state-recreation, or actually circumventing the need for state recreation to begin with).<br>
</p>

<p>
Prototyping-friendly also means predictable and well-balanced execution profile of the runtime, that doesn&rsquo;t chug on un-optimized and naive ad-hoc code &#x2013; e.g. huge data structures, heavy allocation or deep recursion.<br>
</p>
</div>
</div>
<div id="outline-container-org227ddb3" class="outline-3">
<h3 id="org227ddb3"><a href="#org227ddb3">Massively Interacting Computation</a></h3>
<div class="outline-text-3" id="text-org227ddb3">
<p>
A lot of stuff is going to happen. Eventually I&rsquo;m expecting many billions of smallish, interacting computations. In the early stages, where the focus is on modelling the Process abstraction and dynamics, the capacity to handle a couple of millions might be enough, which should be achievable in the cloud, on a small Rasperry Pi cluster or even a bunch of laptops.<br>
</p>

<p>
Before we come to concurrency and parallelism: the concepts are often mixed up, and understandably so &#x2013; <a href="https://wiki.haskell.org/index.php?title=Parallelism_vs._Concurrency">here&rsquo;s an explanation</a> and <a href="https://www.classes.cs.uchicago.edu/archive/2017/spring/22300-1/lectures/ConcurrencyParallelism/ConcurrencyParallelism.pdf">here</a>.<br>
</p>

<p>
The crux with current architectures is that parallelism is tied to the number of <i>physical</i> cores available, and their number is comparatively small. Regular CPUs have a dozen up to a couple of dozen cores, GPUs around 16,000 cores. The ideal thing to have would be something like &ldquo;real-time-soft-scalable&rdquo; parallelism, but in practical terms with current architecture we need both, the &ldquo;normal&rdquo; interleaving or time-slicing concurrency and true parallelism.<br>
</p>
</div>
<div id="outline-container-orge638f85" class="outline-4">
<h4 id="orge638f85"><a href="#orge638f85">Concurrency</a></h4>
<div class="outline-text-4" id="text-orge638f85">
<p>
Since <i>massive</i> concurrency is a basic need (dealing with a lot of things), this will practically rule out concurrency solely based on &ldquo;heavyweight&rdquo; kernel threads.<br>
</p>

<p>
There are basically two facilities in common use that fit massive concurrency: Either <a href="https://en.wikipedia.org/wiki/Actor_model">actor system</a> implementations (the Erlang model) or CSP-style channels (the Concurrent ML or Golang model) &#x2013; <a href="https://wingolog.org/archives/2016/10/12/an-incomplete-history-of-language-facilities-for-concurrency">breakdown here</a>.<br>
</p>

<p>
My first naive idea was to map primitive Protoverse Processes and runtime threads one-to-one, where the runtime threads are scheduled by a runtime and multiplexed to kernel threads. Tying high-level dynamics 1:1 to the confinements of an underlying implementation is probably not the best idea.<br>
</p>

<p>
Here is to note that Protoverse Processes compose into higher-order Processes, which means that way higher-order Protoverse Processes would get automatically more &ldquo;computational power&rdquo;, when the lowest-level Processes are tied to runtime processes/threads or whatever (e.g. Erlang/BEAM processes).<br>
</p>

<p>
However, to model Protoverse Processes (the &ldquo;Entities&rdquo; so to speak) directly via runtime threads/processes may lead to scaling issues pretty quickly, so it would rather make more sense to decouple both and model Protoverse Processes as <i>data</i> instead, and use (ephemeral) runtime processes as an abstracted-away layer that merely &ldquo;carries&rdquo; or &ldquo;supports&rdquo; their dynamics.<br>
</p>
</div>
