blog/engineering.protoverse.project.org
**** Actor Model vs. Process Calculi

*[[https://en.wikipedia.org/wiki/Process_calculus][Process calculi]]* are interesting for the sake of pondering about Process dynamics, as they are languages for modeling concurrent computation.

There's a range of process calculi: [[https://en.wikipedia.org/wiki/%CE%A0-calculus][π-calculus]], [[https://en.wikipedia.org/wiki/Join-calculus][Join calculus]], [[https://en.wikipedia.org/wiki/Ambient_calculus][Ambient calculus]] (related: [[https://en.wikipedia.org/wiki/Mobile_membranes][membranes]]) and several others. I think the π-calculus and Join Calculus are particularly interesting (maybe due to the fact that I didn't look into others as much).

As far as I know, there are no "production-ready" performant languages that implement π-calculus, and π-calculus wouldn't be feasible for distributed systems anyway. However, there are at least two implementations of Join-calculus: [[https://en.wikipedia.org/wiki/JoCaml][JoCaml]] (in OCaml) and [[https://github.com/Chymyst/chymyst-core/][Chymyst]] (in Scala, chemical machine) -- both research projects and abanoned. More common are CSP implementations as mentioned before (Communicating Sequential Processes), e.g. concurrent ML, Clojure's core.async or Go's go-routines; but even though CSP is conceptually related, its capabilities are quite different as CSP lacks the dynamic parts that makes π-calculus and Join-calculus interesting modeling tools.

The *[[https://en.wikipedia.org/wiki/Actor_model][actor model]]* [[https://en.wikipedia.org/wiki/Actor_model_and_process_calculi][differs from process calculi]] in several aspects, for instance actors are based on the idea of individual entities; they are not anonymous, but messages are adressed via unique identifiers. The Actor Model is "modeled after physics" (or a simplified understanding thereof) and very identity-centered. At first glance, this seems to run against the process-relational [[file:metaphysics.protoverse.project.org][Protoverse metaphysics]], as I don't treat "identity" as a "given" or first-order concept, but as as snapshot-like, discretized approximations of relational, dynamic and fluid Processes.

However, we could implement something resembling π-calculus or Join-calculus by a thin layer on top of an existing actor model implementation -- interestingly, that has been done before: see [[https://github.com/rhumbertgz/jerlang][JErlang]], which implements Join-calculus. Such an implementation based on the yet-to-design Protoverse specifcs could then serve as a DSL to express the Protoverse Process dynamics.

*** Task-Parallelism vs. Data-Parallelism

The Proptoverse' model's focus is on relational dynamics, recursive algorithms (e.g. manipulation of nested graphs) to model potentially infinite Nested Scales of Complexity. Protoverse dynamics are supposedly largely irregular at higher levels and highly interconnected, therefore not strictly hierarchical.

This seems to align more with [[https://en.wikipedia.org/wiki/Task_parallelism][task parallelism]] rather than [[https://en.wikipedia.org/wiki/Data_parallelism][data parallelism]]. Due to "big data", data parallelism is more more widespread in use today and generally more efficient (e.g. SIMD). Hence it's worth considering if parts of the dynamics could be computed in a data-parallel approach.

Generally speaking, encapsulation and locality are good indicators for how effectively computations can be parallelized. For deeply nested and interconnected structures, a hybrid approach might be beneficial.
- Using task parallel techniques to manage the high-level structure and irregular tasks;
- Apply data-parallel techniques on subcomponents of the problem where data can be processed uniformly;
- Recursive tasks decompose into smaller problems anyway, where data parallelism can be exploited;

In any case, it makes sense to have straightforward GPU computing readily available if needed (OpenCL, CUDA or HIP).

** Support for Deep Reccursion

Recursion will play a conceptual role (evolutionary dynamics at multiple Nested Scales of Complexity).

"Never send a human to do a machine's job." ---Agent Smith about TCO.

Ok, obligatory mentioning tail call optimization ist just there for the laugh. Actually it's not so much about tail call optimization, but conveniently handling non-tail-recursion -- because more complex recursive algorithms who use the intermediate values returned by successive recursive calls can't always be expressed via recursion in tail-call position.

It's generally possible to circumvent stack overflow by explicitly managing a separate stack as a heap-allocated data structure that collects the outcome of the recursive calls, instead of relying on the call stack -- while the stack management logic could be hidden with helper macros, keeping the code clean and readable; or by using continuation-passing-style, and several other hacks.

While those workarounds are pragmatic, they come with some cognitive overhead and belong to the realm of optimization. Hence, it would be great to have an "unlimited" or dynamically managed call stack depth (some languages allocate call frames to the heap instead) to prevent stack overflows, so that we could write recursive procedures in a naive style for convenience, specifically during prototyping.

** Scalability

Open-endedness is fundamentally about scaling.

First and foremost, the Protoverse will undergo increasing counsumption of resources. Therefore relatively straightforward scaling should be baked-in from the very beginning. It depends on the principal modus operandi of the Protoverse which scaling model to prefer:

- Batch-processing: This approach leans toward vertical scaling, throwing more powerful hardware on it, e.g. CPU/GPU arrays. This hardware wouldn't have to be available all the time.
- Long-running: The Protoverse as a continuously running application could benefit from a horizontal, distributed scaling model. Permanent access to the hardware infrastructure is required.

*** Distributed Computing

Since I anticipate the Protoverse rather as a forever-running application than a batch computation (open-ended quasi-darwinian evolution), I lean towards a distributed, horizontal scaling model with redundant nodes, that runs in the cloud, and eventually might even run on commodity hardware (e.g. a heterogenous peer-to-peer network): much like BOINC, or even like Ethereum or Bitcoin.

