blog/engineering.protoverse.project.html
<div id="outline-container-orgc9ecf3c" class="outline-5">
<h5 id="orgc9ecf3c"><a href="#orgc9ecf3c">Actor Model vs. Process Calculi</a></h5>
<div class="outline-text-5" id="text-orgc9ecf3c">
<p>
<b><a href="https://en.wikipedia.org/wiki/Process_calculus">Process calculi</a></b> are interesting for the sake of pondering about Process dynamics, as they are languages for modeling concurrent computation.<br>
</p>

<p>
There&rsquo;s a range of process calculi: <a href="https://en.wikipedia.org/wiki/%CE%A0-calculus">π-calculus</a>, <a href="https://en.wikipedia.org/wiki/Join-calculus">Join calculus</a>, <a href="https://en.wikipedia.org/wiki/Ambient_calculus">Ambient calculus</a> (related: <a href="https://en.wikipedia.org/wiki/Mobile_membranes">membranes</a>) and several others. I think the π-calculus and Join Calculus are particularly interesting (maybe due to the fact that I didn&rsquo;t look into others as much).<br>
</p>

<p>
As far as I know, there are no &ldquo;production-ready&rdquo; performant languages that implement π-calculus, and π-calculus wouldn&rsquo;t be feasible for distributed systems anyway. However, there are at least two implementations of Join-calculus: <a href="https://en.wikipedia.org/wiki/JoCaml">JoCaml</a> (in OCaml) and <a href="https://github.com/Chymyst/chymyst-core/">Chymyst</a> (in Scala, chemical machine) &#x2013; both research projects and abanoned. More common are CSP implementations as mentioned before (Communicating Sequential Processes), e.g. concurrent ML, Clojure&rsquo;s core.async or Go&rsquo;s go-routines; but even though CSP is conceptually related, its capabilities are quite different as CSP lacks the dynamic parts that makes π-calculus and Join-calculus interesting modeling tools.<br>
</p>

<p>
The <b><a href="https://en.wikipedia.org/wiki/Actor_model">actor model</a></b> <a href="https://en.wikipedia.org/wiki/Actor_model_and_process_calculi">differs from process calculi</a> in several aspects, for instance actors are based on the idea of individual entities; they are not anonymous, but messages are adressed via unique identifiers. The Actor Model is &ldquo;modeled after physics&rdquo; (or a simplified understanding thereof) and very identity-centered. At first glance, this seems to run against the process-relational <a href="metaphysics.protoverse.project.html">Protoverse metaphysics</a>, as I don&rsquo;t treat &ldquo;identity&rdquo; as a &ldquo;given&rdquo; or first-order concept, but as as snapshot-like, discretized approximations of relational, dynamic and fluid Processes.<br>
</p>

<p>
However, we could implement something resembling π-calculus or Join-calculus by a thin layer on top of an existing actor model implementation &#x2013; interestingly, that has been done before: see <a href="https://github.com/rhumbertgz/jerlang">JErlang</a>, which implements Join-calculus. Such an implementation based on the yet-to-design Protoverse specifcs could then serve as a DSL to express the Protoverse Process dynamics.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org7f34828" class="outline-4">
<h4 id="org7f34828"><a href="#org7f34828">Task-Parallelism vs. Data-Parallelism</a></h4>
<div class="outline-text-4" id="text-org7f34828">
<p>
The Proptoverse&rsquo; model&rsquo;s focus is on relational dynamics, recursive algorithms (e.g. manipulation of nested graphs) to model potentially infinite Nested Scales of Complexity. Protoverse dynamics are supposedly largely irregular at higher levels and highly interconnected, therefore not strictly hierarchical.<br>
</p>

<p>
This seems to align more with <a href="https://en.wikipedia.org/wiki/Task_parallelism">task parallelism</a> rather than <a href="https://en.wikipedia.org/wiki/Data_parallelism">data parallelism</a>. Due to &ldquo;big data&rdquo;, data parallelism is more more widespread in use today and generally more efficient (e.g. SIMD). Hence it&rsquo;s worth considering if parts of the dynamics could be computed in a data-parallel approach.<br>
</p>

<p>
Generally speaking, encapsulation and locality are good indicators for how effectively computations can be parallelized. For deeply nested and interconnected structures, a hybrid approach might be beneficial.<br>
</p>
<ul class="org-ul">
<li>Using task parallel techniques to manage the high-level structure and irregular tasks;<br></li>
<li>Apply data-parallel techniques on subcomponents of the problem where data can be processed uniformly;<br></li>
<li>Recursive tasks decompose into smaller problems anyway, where data parallelism can be exploited;<br></li>
</ul>

<p>
In any case, it makes sense to have straightforward GPU computing readily available if needed (OpenCL, CUDA or HIP).<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org8e65bd3" class="outline-3">
<h3 id="org8e65bd3"><a href="#org8e65bd3">Support for Deep Reccursion</a></h3>
<div class="outline-text-3" id="text-org8e65bd3">
<p>
Recursion will play a conceptual role (evolutionary dynamics at multiple Nested Scales of Complexity).<br>
</p>

<p>
&ldquo;Never send a human to do a machine&rsquo;s job.&rdquo; &#x2014;Agent Smith about TCO.<br>
</p>

<p>
Ok, obligatory mentioning tail call optimization ist just there for the laugh. Actually it&rsquo;s not so much about tail call optimization, but conveniently handling non-tail-recursion &#x2013; because more complex recursive algorithms who use the intermediate values returned by successive recursive calls can&rsquo;t always be expressed via recursion in tail-call position.<br>
</p>

<p>
It&rsquo;s generally possible to circumvent stack overflow by explicitly managing a separate stack as a heap-allocated data structure that collects the outcome of the recursive calls, instead of relying on the call stack &#x2013; while the stack management logic could be hidden with helper macros, keeping the code clean and readable; or by using continuation-passing-style, and several other hacks.<br>
</p>

<p>
While those workarounds are pragmatic, they come with some cognitive overhead and belong to the realm of optimization. Hence, it would be great to have an &ldquo;unlimited&rdquo; or dynamically managed call stack depth (some languages allocate call frames to the heap instead) to prevent stack overflows, so that we could write recursive procedures in a naive style for convenience, specifically during prototyping.<br>
</p>
</div>
</div>
<div id="outline-container-orgf2c639a" class="outline-3">
<h3 id="orgf2c639a"><a href="#orgf2c639a">Scalability</a></h3>
<div class="outline-text-3" id="text-orgf2c639a">
<p>
Open-endedness is fundamentally about scaling.<br>
</p>

<p>
First and foremost, the Protoverse will undergo increasing counsumption of resources. Therefore relatively straightforward scaling should be baked-in from the very beginning. It depends on the principal modus operandi of the Protoverse which scaling model to prefer:<br>
</p>

<ul class="org-ul">
<li>Batch-processing: This approach leans toward vertical scaling, throwing more powerful hardware on it, e.g. CPU/GPU arrays. This hardware wouldn&rsquo;t have to be available all the time.<br></li>
<li>Long-running: The Protoverse as a continuously running application could benefit from a horizontal, distributed scaling model. Permanent access to the hardware infrastructure is required.<br></li>
</ul>
</div>
<div id="outline-container-org8b3753d" class="outline-4">
<h4 id="org8b3753d"><a href="#org8b3753d">Distributed Computing</a></h4>
<div class="outline-text-4" id="text-org8b3753d">
<p>
Since I anticipate the Protoverse rather as a forever-running application than a batch computation (open-ended quasi-darwinian evolution), I lean towards a distributed, horizontal scaling model with redundant nodes, that runs in the cloud, and eventually might even run on commodity hardware (e.g. a heterogenous peer-to-peer network): much like BOINC, or even like Ethereum or Bitcoin.<br>
</p>
</div>
</div>
</div>
