blog/engineering.protoverse.project.html
<div id="outline-container-orgcdfca39" class="outline-3">
<h3 id="orgcdfca39"><a href="#orgcdfca39">State Management, Pruning and Data Compression</a></h3>
<div class="outline-text-3" id="text-orgcdfca39">
<p>
We probably have to consider resource-saving techniques earlier in the development process; also taking into consideration, how much of Protoverse history will have to be kept around.<br>
</p>

<p>
Clever resource management plays a larger role if he Protoverse takes the path of being implemeted as a long-running application. There could be intrinsic selection (as a part of the Protoverse dynamics) that effectively prunes certain Nested Scales Of Complexity when it is highly probable that nothing interesting happens at these; e.g. when they turn out random and too boring and therefore &ldquo;non-viable&rdquo;. On the other side &#x2013; even inconspicuous, boring dynamics can turn out to be further influential for evolution, and the extent may be unforeseeable.<br>
</p>
</div>
</div>
<div id="outline-container-org9fa5253" class="outline-3">
<h3 id="org9fa5253"><a href="#org9fa5253">Computation by Need</a></h3>
<div class="outline-text-3" id="text-org9fa5253">
<p>
The concept of &ldquo;observer dependency&rdquo; (which is part of the metaphysics, the universe being participatory) could be understood that the state of a Process is not determined (computed) until it is &ldquo;observed&rdquo; &#x2013; <i>observation as evaluation</i> or observational computation (not to confuse with the &ldquo;Gang of Four&rdquo; observer pattern, which is something else).<br>
</p>

<p>
The analogy becomes stronger, if we buy into the idea that our universe is somehow &ldquo;computational&rdquo;. It seems like deferring the resolution of quantum states is similar to how a computer defers computations by <a href="https://en.wikipedia.org/wiki/Lazy_evaluation">lazy evaluation</a>. Although the analogy is not really correct, both concepts deal with the transition from potential to actual states, implying that states are determined as needed, rather than being predetermined and statically defined.<br>
</p>

<p>
I&rsquo;ve got a feeling that infinite structures for data representation (open-endedness) might be naturally pervasive in the Protoverse, and dealing with this data easily would simplyfy certain things. This may require non-strict evaluation (laziness).<br>
</p>

<p>
Theoretically, might turn out practical to follow such an approach to save computing resources; but it might also turn out extremely impractical (piling up thunks). Any way, it deserves consideration and further thought.<br>
</p>
</div>
</div>
<div id="outline-container-orgc5ae713" class="outline-3">
<h3 id="orgc5ae713"><a href="#orgc5ae713">Portability</a></h3>
<div class="outline-text-3" id="text-orgc5ae713">
<p>
Unforseen complications may likely require to switch certain parts of the implementation during development, e.g. the runtime. It would make sense to write the model in a language that could be ported/plugged into something else without too much effort.<br>
</p>

<p>
The first what comes to mind are C and C++. But these are very low-level, and I&rsquo;m pretty sure I wouldn&rsquo;t come very far with one of these as a modeling language. But there are other aspects:<br>
</p>

<p>
a) Use a high-level language that compiles to either a low-level language or can target multiple backends; for instance, there are a few Scheme dialects that target various platforms, and a growing number of languages target WASM, which could be an interesting runtime, especially with <a href="https://lunatic.solutions/">projects like this</a>.<br>
b) Adher to portable code, that means following a standard closely (e.g. R6RS for the Scheme language &#x2013; ok that&rsquo;s quite a bad example, but you get the idea).<br>
</p>
</div>
</div>
<div id="outline-container-org7632703" class="outline-3">
<h3 id="org7632703"><a href="#org7632703">Observability: Visualization, Analysis and Profiling</a></h3>
<div class="outline-text-3" id="text-org7632703">
<p>
Meta-functionality is complicated stuff and imposes overhead that eats away development resources; it&rsquo;s quite boring but necessary.<br>
</p>

<ul class="org-ul">
<li>Much visualization stuff has been built in JavaScript.<br></li>
<li>So there should be (ideally native) frameworks/libraries available that we can use for data visualization and analysis.<br></li>
<li>Same for performance profiling and tweaking, which is often readily available when building on top of a large-ecosystem virtual machine/platform, such as the BEAM or JVM.<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgb6a7fb3" class="outline-3">
<h3 id="orgb6a7fb3"><a href="#orgb6a7fb3">Interfacing With Other Ecosystems</a></h3>
<div class="outline-text-3" id="text-orgb6a7fb3">
<p>
It might turn out beneficial if a bigger language ecosystem is within reach, either by directly building on that very ecosystem/platform, or via straightforward interop. This might be useful for analysis, visualization, measuring; or to offload heavy computations if they cannot be implemented efficiently in the primary language/runtime; or to use specific scientific libraries. Possible targets are the usual suspects: Rust, C, C++, but also Java and Python.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-orged33c2a" class="outline-2">
<h2 id="orged33c2a"><a href="#orged33c2a">Programming Environment and Language</a></h2>
<div class="outline-text-2" id="text-orged33c2a">
<p>
The following assessment is about choosing the primary platform/language for prototyping, modeling and implementation as much as possible. There are gradual pros/cons which are rather tricky to gauge at this point, not knowing in advance what requirements will turn out more or less important over the course of the project; and there are absolute dealbreakers too.<br>
</p>
</div>
<div id="outline-container-org8edb36b" class="outline-3">
<h3 id="org8edb36b"><a href="#org8edb36b">Conventional Programming Languages and Platforms</a></h3>
<div class="outline-text-3" id="text-org8edb36b">
</div>
