blog/engineering.protoverse.project.org
*** Erlang Platform (BEAM)

- Hot code reloading: support for upgrading a running application; but it's [[https://learnyousomeerlang.com/relups#the-hiccups-of-appups-and-relups][hellish complicated]]; so it seems that it can't be leveraged for interactive development (preserving rather than re-creating state is the goal), and further it does not to compare to Common Lisp's redefining functions and classes within a running system;
- Erlang projects must be written by adhering to the OTP framework in order to reap the fruits of what Erlang has to provide;
- Erlang doesn't provide the same grade of tight-looped interactivity as Common Lisp;
- Erlang has built-in observability ([[https://www.erlang.org/doc/system/profiling.html#large-systems][profilers and analysis tools]]);
- Recursion is idiomatic: dynamically growing stack depth, no stack overflows;
- Each lightweight Erlang process has it's own stack, heap and garbage collection, no global "stop-the-world";
- Responsive under heavy load, fault tolerance facilities;
- Reduced DevOps mess, a plethora of infrastructure tools can be avoided;
- Concurrency primitives readily available at the language level; actor model implementation;
- Ad-hoc parallelism: concurrently executing code is pre-emptively scheduled and will be distributed automatically to all available cores;
- Ad-hoc distributed computing built-in; however distributed Erlang isn't suitable for connecting nodes over the internet in a plug-and-play fashion, because there are no security facilities at all. So it's best used only to connect nodes within an isolated cluster.
- Passing around a lot (or large) messages is inefficient, because shared-nothing message passing involves copying that data;
- Is said to be "slow for CPU-heavy" stuff (probably a matter of concern?), however CPU-heavy code could be written as a NIF, e.g. in Rust;
- Practical cluster size up to ~150 nodes, larger clusters possible with hierarchical clustering and other trickery (see also theoretical [[https://www.erlang.org/doc/system/system_limits.html][system limits]]);
- Large-scale simulations: [[https://www.sciencedirect.com/science/article/abs/pii/S0167739X17311810][Urban traffic]]

/Sentiment: The question would be if the Protoverse model will translate well to the actor model -- on the BEAM, everything is done via actors, there's nothing else. Physical simulations, as far as they might be related, are usually numeric where each data point affects the others./

**** BEAM: Erlang language

- Simple, functional actor-oriented language with pervasive pattern matching;
- Advantages over Elixir/LFE:
  - Simple, consistent and readable syntax;
  - Lingua franca on the BEAM;
  - Lots of in-depth documentation, 3rd-party books and howtos available;
- No Lisp-style metaprogramming (macros) but template system;
- No algebraic data types;
- Fewer libraries than Elixir and less diverse landscape;
- Less suitable for interactive Programming, although [[https://livebook.dev/][Livebook]] supports Erlang;
- No easy reusing libraries from the larger Elixir ecosystem;
- Collab opportunities: Engaged community, focus on infrastructure, industrial-engineering-mindset;

/Sentiment: Erlang is quite a small/simple language. It has no Lisp-style macros, but I think metaprogramming will be useful. And there are some rocks on the road to flowy interactive, explorative programming. The Erlang shell is quite powerful, but designed for maintenace/admin stuff rather than interactive development./

**** BEAM: Elixir language

- Functional actor-oriented language with pervasive pattern matching;
- Advantages over Erlang/LFE
  - More DSL friendly (there's a DSL for [[https://gitlab.com/smaller-infinity/guesswork][logic programming in Elixir]])
  - Nx (tensor operations) and Axon (framework for neuronal networks);
  - Elixir-native interop: [[https://github.com/rusterlium/rustler][Rustler]] (Rust/C/C++ via NIFs);
  - Good interactive development with Emacs and Livebook, incl. plotting, visualization, etc.;
  - Largest library ecosystem on the BEAM, very active;
  - Gradual type system in the making;
- Opinionated and inconsistent language design (mostly syntax), way too much special cases and gotchas for a modern high-level language;
- Steeper learning curve than Erlang or LFE;
- Makes extensive use of metaprogramming (hygienc macros, compile-time only), although it looks quite awkward and verbose compared to Lisp;
- Lazy streams;
- No ADTs, which would be great for modeling;
- Most 3rd-party documentation and howtos are related to the Phoenix web framework and web development;
- Collab opportunities: Community and ecosystem centered around web backend and business apps; building stuff outside of this domain is slooowly taking off (e.g. machine learning);

/Sentiment: I find Elxir rather inconsistent, verbose and clumsy -- syntax-wise, mostly. There are quite a lot WTFs, but Elixir is more interactive-friendly and has at least compile-time macros./

**** LFE (Lisp Flavored Erlang)

- Simple actor-oriented Lisp with pervasive pattern matching;
- Advantages over Elixir/Erlang:
  - Elegant and consistent language design, easy to get into;
  - Much closer to Erlang than Elixir, Erlang documentation translates quite easily;
  - Has real Lisp macros (unhygienic), but compile-time only;
  - Macros are not awkward and verbose like in Elixir;
  - Prototyping: interactive experience on par with Elixir with some differences, e.g. defining named functions directly in the REPL;
- LFE is basically a 2-person hobby project, slow development cycles;
- Documentation is incomplete, fragmented, unpolished and inconsistent, riddled with 404 not found links;
- Emacs integration is outdated and inferior-lfe needs a brush-up (probably I could fix most usability issues in a weekend or two);
- No algebraic data types;
- LFE can't use Elixir libraries seamlessly, so there's no real interop with the largest BEAM ecosystem;
- Erlang libs can be used without problems;
- Collab opportunities: intersection of Lisp/Erlang afficinados (very tiny), far lower momentum than Elixir or Gleam;

/Sentiment: Lisp on the BEAM would be an interesting match if LFE wasn't just a 2-person hobby project./

