blog/engineering.protoverse.project.html
<div id="outline-container-orgaae1f60" class="outline-4">
<h4 id="orgaae1f60"><a href="#orgaae1f60">Erlang Platform (BEAM)</a></h4>
<div class="outline-text-4" id="text-orgaae1f60">
<ul class="org-ul">
<li>Hot code reloading: support for upgrading a running application; but it&rsquo;s <a href="https://learnyousomeerlang.com/relups#the-hiccups-of-appups-and-relups">hellish complicated</a>; so it seems that it can&rsquo;t be leveraged for interactive development (preserving rather than re-creating state is the goal), and further it does not to compare to Common Lisp&rsquo;s redefining functions and classes within a running system;<br></li>
<li>Erlang projects must be written by adhering to the OTP framework in order to reap the fruits of what Erlang has to provide;<br></li>
<li>Erlang doesn&rsquo;t provide the same grade of tight-looped interactivity as Common Lisp;<br></li>
<li>Erlang has built-in observability (<a href="https://www.erlang.org/doc/system/profiling.html#large-systems">profilers and analysis tools</a>);<br></li>
<li>Recursion is idiomatic: dynamically growing stack depth, no stack overflows;<br></li>
<li>Each lightweight Erlang process has it&rsquo;s own stack, heap and garbage collection, no global &ldquo;stop-the-world&rdquo;;<br></li>
<li>Responsive under heavy load, fault tolerance facilities;<br></li>
<li>Reduced DevOps mess, a plethora of infrastructure tools can be avoided;<br></li>
<li>Concurrency primitives readily available at the language level; actor model implementation;<br></li>
<li>Ad-hoc parallelism: concurrently executing code is pre-emptively scheduled and will be distributed automatically to all available cores;<br></li>
<li>Ad-hoc distributed computing built-in; however distributed Erlang isn&rsquo;t suitable for connecting nodes over the internet in a plug-and-play fashion, because there are no security facilities at all. So it&rsquo;s best used only to connect nodes within an isolated cluster.<br></li>
<li>Passing around a lot (or large) messages is inefficient, because shared-nothing message passing involves copying that data;<br></li>
<li>Is said to be &ldquo;slow for CPU-heavy&rdquo; stuff (probably a matter of concern?), however CPU-heavy code could be written as a NIF, e.g. in Rust;<br></li>
<li>Practical cluster size up to ~150 nodes, larger clusters possible with hierarchical clustering and other trickery (see also theoretical <a href="https://www.erlang.org/doc/system/system_limits.html">system limits</a>);<br></li>
<li>Large-scale simulations: <a href="https://www.sciencedirect.com/science/article/abs/pii/S0167739X17311810">Urban traffic</a><br></li>
</ul>

<p>
<i>Sentiment: The question would be if the Protoverse model will translate well to the actor model &#x2013; on the BEAM, everything is done via actors, there&rsquo;s nothing else. Physical simulations, as far as they might be related, are usually numeric where each data point affects the others.</i><br>
</p>
</div>
<div id="outline-container-orgb1d3a3b" class="outline-5">
<h5 id="orgb1d3a3b"><a href="#orgb1d3a3b">BEAM: Erlang language</a></h5>
<div class="outline-text-5" id="text-orgb1d3a3b">
<ul class="org-ul">
<li>Simple, functional actor-oriented language with pervasive pattern matching;<br></li>
<li>Advantages over Elixir/LFE:<br>
<ul class="org-ul">
<li>Simple, consistent and readable syntax;<br></li>
<li>Lingua franca on the BEAM;<br></li>
<li>Lots of in-depth documentation, 3rd-party books and howtos available;<br></li>
</ul></li>
<li>No Lisp-style metaprogramming (macros) but template system;<br></li>
<li>No algebraic data types;<br></li>
<li>Fewer libraries than Elixir and less diverse landscape;<br></li>
<li>Less suitable for interactive Programming, although <a href="https://livebook.dev/">Livebook</a> supports Erlang;<br></li>
<li>No easy reusing libraries from the larger Elixir ecosystem;<br></li>
<li>Collab opportunities: Engaged community, focus on infrastructure, industrial-engineering-mindset;<br></li>
</ul>

<p>
<i>Sentiment: Erlang is quite a small/simple language. It has no Lisp-style macros, but I think metaprogramming will be useful. And there are some rocks on the road to flowy interactive, explorative programming. The Erlang shell is quite powerful, but designed for maintenace/admin stuff rather than interactive development.</i><br>
</p>
</div>
</div>
<div id="outline-container-org3b90ca3" class="outline-5">
<h5 id="org3b90ca3"><a href="#org3b90ca3">BEAM: Elixir language</a></h5>
<div class="outline-text-5" id="text-org3b90ca3">
<ul class="org-ul">
<li>Functional actor-oriented language with pervasive pattern matching;<br></li>
<li>Advantages over Erlang/LFE<br>
<ul class="org-ul">
<li>More DSL friendly (there&rsquo;s a DSL for <a href="https://gitlab.com/smaller-infinity/guesswork">logic programming in Elixir</a>)<br></li>
<li>Nx (tensor operations) and Axon (framework for neuronal networks);<br></li>
<li>Elixir-native interop: <a href="https://github.com/rusterlium/rustler">Rustler</a> (Rust/C/C++ via NIFs);<br></li>
<li>Good interactive development with Emacs and Livebook, incl. plotting, visualization, etc.;<br></li>
<li>Largest library ecosystem on the BEAM, very active;<br></li>
<li>Gradual type system in the making;<br></li>
</ul></li>
<li>Opinionated and inconsistent language design (mostly syntax), way too much special cases and gotchas for a modern high-level language;<br></li>
<li>Steeper learning curve than Erlang or LFE;<br></li>
<li>Makes extensive use of metaprogramming (hygienc macros, compile-time only), although it looks quite awkward and verbose compared to Lisp;<br></li>
<li>Lazy streams;<br></li>
<li>No ADTs, which would be great for modeling;<br></li>
<li>Most 3rd-party documentation and howtos are related to the Phoenix web framework and web development;<br></li>
<li>Collab opportunities: Community and ecosystem centered around web backend and business apps; building stuff outside of this domain is slooowly taking off (e.g. machine learning);<br></li>
</ul>

<p>
<i>Sentiment: I find Elxir rather inconsistent, verbose and clumsy &#x2013; syntax-wise, mostly. There are quite a lot WTFs, but Elixir is more interactive-friendly and has at least compile-time macros.</i><br>
</p>
</div>
</div>
<div id="outline-container-org917624b" class="outline-5">
<h5 id="org917624b"><a href="#org917624b">LFE (Lisp Flavored Erlang)</a></h5>
<div class="outline-text-5" id="text-org917624b">
<ul class="org-ul">
<li>Simple actor-oriented Lisp with pervasive pattern matching;<br></li>
<li>Advantages over Elixir/Erlang:<br>
<ul class="org-ul">
<li>Elegant and consistent language design, easy to get into;<br></li>
<li>Much closer to Erlang than Elixir, Erlang documentation translates quite easily;<br></li>
<li>Has real Lisp macros (unhygienic), but compile-time only;<br></li>
<li>Macros are not awkward and verbose like in Elixir;<br></li>
<li>Prototyping: interactive experience on par with Elixir with some differences, e.g. defining named functions directly in the REPL;<br></li>
</ul></li>
<li>LFE is basically a 2-person hobby project, slow development cycles;<br></li>
<li>Documentation is incomplete, fragmented, unpolished and inconsistent, riddled with 404 not found links;<br></li>
<li>Emacs integration is outdated and inferior-lfe needs a brush-up (probably I could fix most usability issues in a weekend or two);<br></li>
<li>No algebraic data types;<br></li>
<li>LFE can&rsquo;t use Elixir libraries seamlessly, so there&rsquo;s no real interop with the largest BEAM ecosystem;<br></li>
<li>Erlang libs can be used without problems;<br></li>
<li>Collab opportunities: intersection of Lisp/Erlang afficinados (very tiny), far lower momentum than Elixir or Gleam;<br></li>
</ul>

<p>
<i>Sentiment: Lisp on the BEAM would be an interesting match if LFE wasn&rsquo;t just a 2-person hobby project.</i><br>
</p>
</div>
</div>
</div>
