blog/engineering.protoverse.project.org
*** Guile Scheme

- Clean, highly general, expressive;
- Astonishingly "general purporse" for an extension language;
- Schene is great for prototyping abstractions and algorithms;
- Full metaprogramming (syntax-rules, syntax-case, defmacro);
- Capable for [[https://en.wikipedia.org/wiki/Metalinguistic_abstraction][metalinguistig abstraction]] (see also [[https://en.wikipedia.org/wiki/Language-oriented_programming][LOP]]);
- Good for interactive development (Emacs with Geiser);
- Relies on Guix for package management (MacOS unsupported) or homebrew;
- There's a tiny library ecosystem;
- JIT compiler;
- [[https://www.gnu.org/software/guile/manual/guile.html#Stack-Overflow-1][Unlimited stack depth for Scheme code]], TCO available;
- Concurrency and multicore [[https://github.com/wingo/fibers/wiki/Manual#13-parallelism][parallelism]] via [[https://github.com/wingo/fibers][fibers]] ([[https://github.com/wingo/fibers/wiki/Manual][manual]]), Concurrent ML / CSP style, preemptive(?) scheduler;
- Distributed: [[https://spritely.institute/goblins/][Goblins]] actor-framework in the making ([[https://spritely.institute/files/docs/guile-goblins/0.14.0/index.html][docs]]), for P2P;
- Performance looks well-balanced, and Guile digests allocation-heavy surprisingly well -- even though v3.0.10 has still the old garbage collector;
- Collab opportunities: GNU and Scheme enthusiasts, academic;

/Sentiment: Due to the Fibers library and its scheduler, Guile is quite interesting, and it supports parallel execution (multi-threading) out-of-the-box. My own benchmarks have shown that Guile seems to run reasonably fast even with naive/un-optimized but demanding code, which is nice for prototyping./

*** Racket

- Clean, higly general and the most expressive I guess;
- Racket is great for prototyping abstractions and algorithms;
- Full metaprogramming (syntax-rules, syntax-case, defmacro);
- Built for [[https://en.wikipedia.org/wiki/Metalinguistic_abstraction][metalinguistig abstraction]] (see also [[https://en.wikipedia.org/wiki/Language-oriented_programming][LOP]]);
- Not so bad for interactive development (in Emacs), but much less interactive capabilites than say Common Lisp or Guile Scheme;
- Various concurrency facilities, green threads;
- Parallelism: [[https://docs.racket-lang.org/guide/parallelism.html][Places]] looks quite limiting;
- Racket v9.0 [[https://blog.racket-lang.org/2025/11/parallel-threads.html][introduced parallel threads]]
- Distributed: Places are also [[https://docs.racket-lang.org/distributed-places/index.html][used for distribution]]; further there are a [[https://git.syndicate-lang.org/syndicate-lang/syndicate-rkt/src/branch/main/syndicate][Syndicated Actors]] implementation and a [[https://docs.racket-lang.org/goblins/][Spritely Goblins]] implementation that's behind the canonical one; both are experimental.

/Sentiment: Racket seems quite interesting in principle, but Racket is opinionated against interactive use and incremental compilation/evaluation, which Guile offers. Multi-threading in Racket is new and only low-level facilities exist at this point, while Guile has it for longer./

*** Gambit / Gerbil Scheme

- "Distributed" actor-model centric Scheme implementation based on Ganbit Scheme
- Clean, higly general, expressive;
- Scheme is great for prototyping abstractions and algorithms;
- Powerful metaprogramming;
- Connect REPL to running program (actor ensemble server);
- Very tiny library ecosystem;
- No LSP implementation yet, planned for v0.19 release;
- Interactive development: Emacs integration is thrown together and buggy;
- Multiprocessor-parallelism (SMP) [[https://github.com/mighty-gerbils/gerbil/issues/837][not working yet]], depends on Gambit Scheme implementation;
- Built-in concurrency (actor model) based on light-weight Gambit threads;
- Ad-hoc distributed computing with [[https://cons.io/tutorials/ensemble.html][actor ensembles]];
- Compiles to C, overall performance on CPU-heavy tasks supposedly better than Guile's;
- Small documentation, but gives a well-rounded overview;
- Collab opportunities: Scheme enthusiasts, academic;

/Sentiment: Gerbil Scheme is a promising project but in a very early stage (v0.18.0), and doesn't support multiple CPU cores. The interactivity and Emacs integration isn't comparable to Guile's, e.g. documentation or code autocompletion./

*** Julia

- The only conventional imperative language considered so far;
- Pattern matching and other niceties are available via [[https://github.com/thautwarm/MLStyle.jl][MLStyle.jl]] library;
- Recursion is not idiomatic, you'll have to use imperative loops everywhere, Julia's stack depth is capped;
- For deep recursion, you would have to manage a separate stack as a data structure, or resort to other workarounds.
- Metaprogramming via macros is available;
- A running program can be debugged and modified, new functions can be defined and added (with caveats; not extensively as in Common Lisp);
- Dynamic typing, but allows type annotations (mostly for performance reasons); [[https://thautwarm.github.io/MLStyle.jl/latest/preview.html#generalized-algebraic-data-types][Algebraic Data Types via MLStyle.jl]]
- Parallel and distributed computing out-of-the-box (cluster-oriented), but it seems not very high-level;
- Shiny convenience libraries for all kinds of scientific stuff, visualization and plotting;
- Direct calling of C functions and access to Python libraries;
- Has native access to GPU computing (CUDA only);
- Low-level access to the language itself;
- Collab opportunities: data-, science and simulation folks of all sorts;

/Sentiment: Julia is an interesting choice and checks many boxes -- the ecosystem fits the domain, which is scientific computing and simulation, and Julia is a good fit for CPU-bound workloads. But I'm not convinced because conceptually, deep recursion will play a crucial role in the Protoverse model, which doessn't translate well to how things are done in Julia./

