blog/engineering.protoverse.project.html
<div id="outline-container-orgb227128" class="outline-4">
<h4 id="orgb227128"><a href="#orgb227128">Guile Scheme</a></h4>
<div class="outline-text-4" id="text-orgb227128">
<ul class="org-ul">
<li>Clean, highly general, expressive;<br></li>
<li>Astonishingly &ldquo;general purporse&rdquo; for an extension language;<br></li>
<li>Schene is great for prototyping abstractions and algorithms;<br></li>
<li>Full metaprogramming (syntax-rules, syntax-case, defmacro);<br></li>
<li>Capable for <a href="https://en.wikipedia.org/wiki/Metalinguistic_abstraction">metalinguistig abstraction</a> (see also <a href="https://en.wikipedia.org/wiki/Language-oriented_programming">LOP</a>);<br></li>
<li>Good for interactive development (Emacs with Geiser);<br></li>
<li>Relies on Guix for package management (MacOS unsupported) or homebrew;<br></li>
<li>There&rsquo;s a tiny library ecosystem;<br></li>
<li>JIT compiler;<br></li>
<li><a href="https://www.gnu.org/software/guile/manual/guile.html#Stack-Overflow-1">Unlimited stack depth for Scheme code</a>, TCO available;<br></li>
<li>Concurrency and multicore <a href="https://github.com/wingo/fibers/wiki/Manual#13-parallelism">parallelism</a> via <a href="https://github.com/wingo/fibers">fibers</a> (<a href="https://github.com/wingo/fibers/wiki/Manual">manual</a>), Concurrent ML / CSP style, preemptive(?) scheduler;<br></li>
<li>Distributed: <a href="https://spritely.institute/goblins/">Goblins</a> actor-framework in the making (<a href="https://spritely.institute/files/docs/guile-goblins/0.14.0/index.html">docs</a>), for P2P;<br></li>
<li><a href="https://github.com/opencog/atomspace">OpenCog Atomspace</a>: possible backend for the Protoverse with Guile interface; it&rsquo;s a in-RAM generalized hypergraph store and rewriting system;<br></li>
<li>Performance looks well-balanced, and Guile digests allocation-heavy surprisingly well &#x2013; even though v3.0.10 has still the old garbage collector;<br></li>
<li>Collab opportunities: GNU and Scheme enthusiasts, academic;<br></li>
</ul>

<p>
<i>Sentiment: Due to the Fibers library and its scheduler, Guile is quite interesting, and it supports parallel execution (multi-threading) out-of-the-box. My own benchmarks have shown that Guile seems to run reasonably fast even with naive/un-optimized but demanding code, which is nice for prototyping.</i><br>
</p>
</div>
</div>
<div id="outline-container-org7c7a080" class="outline-4">
<h4 id="org7c7a080"><a href="#org7c7a080">Racket</a></h4>
<div class="outline-text-4" id="text-org7c7a080">
<ul class="org-ul">
<li>Clean, higly general and the most expressive I guess;<br></li>
<li>Racket is great for prototyping abstractions and algorithms;<br></li>
<li>Full metaprogramming (syntax-rules, syntax-case, defmacro);<br></li>
<li>Built for <a href="https://en.wikipedia.org/wiki/Metalinguistic_abstraction">metalinguistig abstraction</a> (see also <a href="https://en.wikipedia.org/wiki/Language-oriented_programming">LOP</a>);<br></li>
<li>Not so bad for interactive development (in Emacs), but much less interactive capabilites than say Common Lisp or Guile Scheme;<br></li>
<li>Various concurrency facilities, green threads;<br></li>
<li>Parallelism: <a href="https://docs.racket-lang.org/guide/parallelism.html">Places</a> looks quite limiting;<br></li>
<li>Racket v9.0 <a href="https://blog.racket-lang.org/2025/11/parallel-threads.html">introduced parallel threads</a><br></li>
<li>Distributed: Places are also <a href="https://docs.racket-lang.org/distributed-places/index.html">used for distribution</a>; further there are a <a href="https://git.syndicate-lang.org/syndicate-lang/syndicate-rkt/src/branch/main/syndicate">Syndicated Actors</a> implementation and a <a href="https://docs.racket-lang.org/goblins/">Spritely Goblins</a> implementation that&rsquo;s behind the canonical one; both are experimental.<br></li>
</ul>

<p>
<i>Sentiment: Racket seems quite interesting in principle, but Racket is opinionated against interactive use and incremental compilation/evaluation, which Guile offers. Multi-threading in Racket is new and only low-level facilities exist at this point, while Guile has it for longer.</i><br>
</p>
</div>
</div>
<div id="outline-container-org2012fce" class="outline-4">
<h4 id="org2012fce"><a href="#org2012fce">Gambit / Gerbil Scheme</a></h4>
<div class="outline-text-4" id="text-org2012fce">
<ul class="org-ul">
<li>&ldquo;Distributed&rdquo; actor-model centric Scheme implementation based on Ganbit Scheme<br></li>
<li>Clean, higly general, expressive;<br></li>
<li>Scheme is great for prototyping abstractions and algorithms;<br></li>
<li>Powerful metaprogramming;<br></li>
<li>Connect REPL to running program (actor ensemble server);<br></li>
<li>Very tiny library ecosystem;<br></li>
<li>No LSP implementation yet, planned for v0.19 release;<br></li>
<li>Interactive development: Emacs integration is thrown together and buggy;<br></li>
<li>Multiprocessor-parallelism (SMP) <a href="https://github.com/mighty-gerbils/gerbil/issues/837">not working yet</a>, depends on Gambit Scheme implementation;<br></li>
<li>Built-in concurrency (actor model) based on light-weight Gambit threads;<br></li>
<li>Ad-hoc distributed computing with <a href="https://cons.io/tutorials/ensemble.html">actor ensembles</a>;<br></li>
<li>Compiles to C, overall performance on CPU-heavy tasks supposedly better than Guile&rsquo;s;<br></li>
<li>Small documentation, but gives a well-rounded overview;<br></li>
<li>Collab opportunities: Scheme enthusiasts, academic;<br></li>
</ul>

<p>
<i>Sentiment: Gerbil Scheme is a promising project but in a very early stage (v0.18.0), and doesn&rsquo;t support multiple CPU cores. The interactivity and Emacs integration isn&rsquo;t comparable to Guile&rsquo;s, e.g. documentation or code autocompletion.</i><br>
</p>
</div>
</div>
<div id="outline-container-org2d4afc2" class="outline-4">
<h4 id="org2d4afc2"><a href="#org2d4afc2">Julia</a></h4>
<div class="outline-text-4" id="text-org2d4afc2">
<ul class="org-ul">
<li>The only conventional imperative language considered so far;<br></li>
<li>Pattern matching and other niceties are available via <a href="https://github.com/thautwarm/MLStyle.jl">MLStyle.jl</a> library;<br></li>
<li>Recursion is not idiomatic, you&rsquo;ll have to use imperative loops everywhere, Julia&rsquo;s stack depth is capped;<br></li>
<li>For deep recursion, you would have to manage a separate stack as a data structure, or resort to other workarounds.<br></li>
<li>Metaprogramming via macros is available;<br></li>
<li>A running program can be debugged and modified, new functions can be defined and added (with caveats; not extensively as in Common Lisp);<br></li>
<li>Dynamic typing, but allows type annotations (mostly for performance reasons); <a href="https://thautwarm.github.io/MLStyle.jl/latest/preview.html#generalized-algebraic-data-types">Algebraic Data Types via MLStyle.jl</a><br></li>
<li>Parallel and distributed computing out-of-the-box (cluster-oriented), but it seems not very high-level;<br></li>
<li>Shiny convenience libraries for all kinds of scientific stuff, visualization and plotting;<br></li>
<li>Direct calling of C functions and access to Python libraries;<br></li>
<li>Has native access to GPU computing (CUDA only);<br></li>
<li>Low-level access to the language itself;<br></li>
<li>Collab opportunities: data-, science and simulation folks of all sorts;<br></li>
</ul>

<p>
<i>Sentiment: Julia is an interesting choice and checks many boxes &#x2013; the ecosystem fits the domain, which is scientific computing and simulation, and Julia is a good fit for CPU-bound workloads. But I&rsquo;m not convinced because conceptually, deep recursion will play a crucial role in the Protoverse model, which doessn&rsquo;t translate well to how things are done in Julia.</i><br>
</p>
</div>
</div>
