blog/engineering.protoverse.project.org
*** OCaml

- Functional language with pervasive pattern matching, elegant and very readable syntax;
- There has been a [[https://www.ocamlwiki.com/wiki/Join_calculus][process calculus]] implemented in OCaml, but abandoned;
- No true interactive programming; cannot connect to, or modify a running program; program would have to run in the in the REPL to begin with;
- Static type system makes refactoring fun and documentation effective;
- ADTs are great for modeling;
- No real macros but just template preprocessing of sorts, but it has a very powerful module system (which is something entirely different compared to module systems in other languages);
- Concurrency: There's an early-stage actor library [[https://github.com/riot-ml/riot][Riot]] based on algebraic effects and effect handlers, OCaml's goto-concurrency [[https://ocaml.org/p/lwt/latest][Lwt]] implements promises instead;
- [[http://ocamlverse.net/content/parallelism.html#domain-thread-based-parallelism][Parallelism since 5.0]] using domainslib;
- No ad-hoc distributed computing
- There's [[https://mirage.io/][Mirage OS]] that lets you compile your application directly into a full "micro operating system", it can be used to deploy nodes for a distributed system;
- Overall performant, super fast compiler;
- Messy tooling and workflow -- there's always a new surprise tbat something stopped working;
- Colaboration opportunities: engaged community, language ecosystem under active development, FP-pragmatics;

/Sentiment: It's my favorite language actually, but the tooling (Opam, Dune build system, Ocaml REPL and Utop REPL) is such a mess and I couldn't get it to work fine in Emacs, even though I spent considerable time with it. Well, and there's no real interactive development./

*** Haskell

- Functional language, expressive and low-noise, lovely syntax;
- No support to modify a running program, only REPL (what about [[https://hackage.haskell.org/package/rapid][rapid]]?);
- Non-strict evaluation is elegant, simplifies handling of infinite structures; but laziness is available in other languages when you need it;
- Static typing simplifies refactoring and improves reasoning, type system is great for modeling;
- Concurrency: [[http://haskell-distributed.github.io/documentation.html#concurrency-and-distribution][Cloud Haskell]] (actors) allows also message passing using [[https://haskell-distributed.github.io/documentation.html#typed-channels][typed channels]], where the SendPort of a channel can be passed to other processes via message; processes don't share state; seems unpolished, not much used and and there are few how-tos;
- While excellent Haskell learning material is abundant, libraries lack of howtos, examples and documentation;
- Libraries tend to use numerous language extensions, many WTFs;
- Purely functional code is good for parallelization (in principle); not sure how actor model message passing (wich is basically IO), the type system and purity go together; it might turn out very awkward, basically most of the code will live in the IO monad;
- Collab opportunities: engaged community, FP-enthusiasts;

/Sentiment: I'm afraid of lazy-per-default, that managing resource usage may become too complicated and a lot time is spent on fighting Haskell's opinions. Seems no great choice for explorative programming, except maybe you work basically on the type level./

*** NIM

- Multi-paradigm, expressive and low-noise;
- There's a [[https://github.com/inim-repl/INim][REPL]] for interactive development;
- Metaprogramming via templates and real compile-time macros;
- [[https://nim-lang.org/docs/hcr.html][Hot code reloading]] available to alter a running program;
- Static typing + algebraic data types;
- Supports multicore (SMP) parallelism using a thread pool;
- Portability: compiles to C, JavaScript, and several other backends;
- Recursion depth is adjustable via compiler options, but the option accepts int16, which means no more than 32,767 recursion depth(?);
- The language is both high-and low-level, has multiple GC options and also manual memory management;
- Both concurrency and parallelism primitives seem rather low level and target native OS threads rather than lightweight threads;
- There are some high-level concurrency implementations, e.g. "[[https://git.syndicate-lang.org/ehmry/syndicate-nim][Syndicated Actors]]" ([[https://news.ycombinator.com/item?id=41244468][discussion]]), however this is something entirely different from Erlang's communicating lightweight processes; in its application possibilities it seems related to [[https://spritely.institute/goblins/][Spritely Goblins]];
- Has many interesting libraries, e.g. a [[https://github.com/mratsim/Synthesis][state-machine generator]];
- The language should be kinda stable, but then there are a lot of deprecations and even a rewrite of the compiler going on;
- Collab opportunities: Even though the language doesn't draw a lot of attention, there's already a very diverse landscape of libraries and projects written in NIM, and attracts even academics.

*** Lua

- Simple, versatile and multi-paradigm, quite expressive
- No ad-hoc inspection of values or data structures (well, tables) - coming from Lisp languages, this feels like driving with eyes closed;
- Some gotchas, e.g. discarding arguments when functions are applied to too many arguments, the local vs. global thing, and verbosity;
- There are workarounds, e.g. [[https://fennel-lang.org/][Fennel as a lispy language]] that transpiles to Lua but keeps Lua semantics;
- Has tail call optimization, which is nice;
- LuaJIT runtime for high performance;
- Single-core concurrency only;
- There are some attempts for multithreading, [[https://github.com/LuaLanes/lanes][the one under active development is LuaLanes]];

