blog/engineering.protoverse.project.html
<div id="outline-container-org9434fee" class="outline-4">
<h4 id="org9434fee"><a href="#org9434fee">OCaml</a></h4>
<div class="outline-text-4" id="text-org9434fee">
<ul class="org-ul">
<li>Functional language with pervasive pattern matching, elegant and very readable syntax;<br></li>
<li>There has been a <a href="https://www.ocamlwiki.com/wiki/Join_calculus">process calculus</a> implemented in OCaml, but abandoned;<br></li>
<li>No true interactive programming; cannot connect to, or modify a running program; program would have to run in the in the REPL to begin with;<br></li>
<li>Static type system makes refactoring fun and documentation effective;<br></li>
<li>ADTs are great for modeling;<br></li>
<li>No real macros but just template preprocessing of sorts, but it has a very powerful module system (which is something entirely different compared to module systems in other languages);<br></li>
<li>Concurrency: There&rsquo;s an early-stage actor library <a href="https://github.com/riot-ml/riot">Riot</a> based on algebraic effects and effect handlers, OCaml&rsquo;s goto-concurrency <a href="https://ocaml.org/p/lwt/latest">Lwt</a> implements promises instead;<br></li>
<li><a href="http://ocamlverse.net/content/parallelism.html#domain-thread-based-parallelism">Parallelism since 5.0</a> using domainslib;<br></li>
<li>No ad-hoc distributed computing<br></li>
<li>There&rsquo;s <a href="https://mirage.io/">Mirage OS</a> that lets you compile your application directly into a full &ldquo;micro operating system&rdquo;, it can be used to deploy nodes for a distributed system;<br></li>
<li>Overall performant, super fast compiler;<br></li>
<li>Messy tooling and workflow &#x2013; there&rsquo;s always a new surprise tbat something stopped working;<br></li>
<li>Colaboration opportunities: engaged community, language ecosystem under active development, FP-pragmatics;<br></li>
</ul>

<p>
<i>Sentiment: It&rsquo;s my favorite language actually, but the tooling (Opam, Dune build system, Ocaml REPL and Utop REPL) is such a mess and I couldn&rsquo;t get it to work fine in Emacs, even though I spent considerable time with it. Well, and there&rsquo;s no real interactive development.</i><br>
</p>
</div>
</div>
<div id="outline-container-org2209edd" class="outline-4">
<h4 id="org2209edd"><a href="#org2209edd">Haskell</a></h4>
<div class="outline-text-4" id="text-org2209edd">
<ul class="org-ul">
<li>Functional language, expressive and low-noise, lovely syntax;<br></li>
<li>No support to modify a running program, only REPL (what about <a href="https://hackage.haskell.org/package/rapid">rapid</a>?);<br></li>
<li>Non-strict evaluation is elegant, simplifies handling of infinite structures; but laziness is available in other languages when you need it;<br></li>
<li>Static typing simplifies refactoring and improves reasoning, type system is great for modeling;<br></li>
<li>Concurrency: <a href="http://haskell-distributed.github.io/documentation.html#concurrency-and-distribution">Cloud Haskell</a> (actors) allows also message passing using <a href="https://haskell-distributed.github.io/documentation.html#typed-channels">typed channels</a>, where the SendPort of a channel can be passed to other processes via message; processes don&rsquo;t share state; seems unpolished, not much used and and there are few how-tos;<br></li>
<li>While excellent Haskell learning material is abundant, libraries lack of howtos, examples and documentation;<br></li>
<li>Libraries tend to use numerous language extensions, many WTFs;<br></li>
<li>Purely functional code is good for parallelization (in principle); not sure how actor model message passing (wich is basically IO), the type system and purity go together; it might turn out very awkward, basically most of the code will live in the IO monad;<br></li>
<li>Collab opportunities: engaged community, FP-enthusiasts;<br></li>
</ul>

<p>
<i>Sentiment: I&rsquo;m afraid of lazy-per-default, that managing resource usage may become too complicated and a lot time is spent on fighting Haskell&rsquo;s opinions. Seems no great choice for explorative programming, except maybe you work basically on the type level.</i><br>
</p>
</div>
</div>
<div id="outline-container-orgf567a81" class="outline-4">
<h4 id="orgf567a81"><a href="#orgf567a81">NIM</a></h4>
<div class="outline-text-4" id="text-orgf567a81">
<ul class="org-ul">
<li>Multi-paradigm, expressive and low-noise;<br></li>
<li>There&rsquo;s a <a href="https://github.com/inim-repl/INim">REPL</a> for interactive development;<br></li>
<li>Metaprogramming via templates and real compile-time macros;<br></li>
<li><a href="https://nim-lang.org/docs/hcr.html">Hot code reloading</a> available to alter a running program;<br></li>
<li>Static typing + algebraic data types;<br></li>
<li>Supports multicore (SMP) parallelism using a thread pool;<br></li>
<li>Portability: compiles to C, JavaScript, and several other backends;<br></li>
<li>Recursion depth is adjustable via compiler options, but the option accepts int16, which means no more than 32,767 recursion depth(?);<br></li>
<li>The language is both high-and low-level, has multiple GC options and also manual memory management;<br></li>
<li>Both concurrency and parallelism primitives seem rather low level and target native OS threads rather than lightweight threads;<br></li>
<li>There are some high-level concurrency implementations, e.g. &ldquo;<a href="https://git.syndicate-lang.org/ehmry/syndicate-nim">Syndicated Actors</a>&rdquo; (<a href="https://news.ycombinator.com/item?id=41244468">discussion</a>), however this is something entirely different from Erlang&rsquo;s communicating lightweight processes; in its application possibilities it seems related to <a href="https://spritely.institute/goblins/">Spritely Goblins</a>;<br></li>
<li>Has many interesting libraries, e.g. a <a href="https://github.com/mratsim/Synthesis">state-machine generator</a>;<br></li>
<li>The language should be kinda stable, but then there are a lot of deprecations and even a rewrite of the compiler going on;<br></li>
<li>Collab opportunities: Even though the language doesn&rsquo;t draw a lot of attention, there&rsquo;s already a very diverse landscape of libraries and projects written in NIM, and attracts even academics.<br></li>
</ul>
</div>
</div>
<div id="outline-container-orge38dc2c" class="outline-4">
<h4 id="orge38dc2c"><a href="#orge38dc2c">Lua</a></h4>
<div class="outline-text-4" id="text-orge38dc2c">
<ul class="org-ul">
<li>Simple, versatile and multi-paradigm, quite expressive<br></li>
<li>No ad-hoc inspection of values or data structures (well, tables) - coming from Lisp languages, this feels like driving with eyes closed;<br></li>
<li>Some gotchas, e.g. discarding arguments when functions are applied to too many arguments, the local vs. global thing, and verbosity;<br></li>
<li>There are workarounds, e.g. <a href="https://fennel-lang.org/">Fennel as a lispy language</a> that transpiles to Lua but keeps Lua semantics;<br></li>
<li>Has tail call optimization, which is nice;<br></li>
<li>LuaJIT runtime for high performance;<br></li>
<li>Single-core concurrency only;<br></li>
<li>There are some attempts for multithreading, <a href="https://github.com/LuaLanes/lanes">the one under active development is LuaLanes</a>;<br></li>
</ul>
</div>
</div>
