blog/engineering.protoverse.project.org
*** JVM: Clojure

- Functional paradigm, in principle a nice and clean take on Lisp;
- Recursion support: no TCO, but acknowledged by loop/recur workaround due to JVM limitations;
- Interactive and live-coding, working at the running program is possible;
- Great Emacs integration and prototyping ergonomics;
- Has metaprogramming (hygienic), but that seems rather discouraged;
- Optional type system [[https://github.com/typedclojure/typedclojure][Typed Clojure]] (?); [[https://clojure.org/about/spec][clojure.spec]] isn't a type system but for runtime validation;
- Lazy sequences;
- Concurrency: Several concurrency abstractions; [[https://www.youtube.com/watch?v=yJxFPoxqzWE][core.async]] implements [[https://en.wikipedia.org/wiki/Communicating_sequential_processes][CSP-style]] concurrency and allows channels to be passed as values; but memory is shared (unlike Erlang's processes);
- I ran into various errors when I did naive benchmarks involving 100k concurrent computations via core.async "go blocks", depending on which concurrency facility used;
- Portability: Clojure targets several host platforms officially, e.g. JVM, JavaScript, CLR; and there are inofficial implementations, e.g. Erlang/Beam, but these are highly experimental;
- Observability: JVM has lots of profilers and tools;
- Clojure has a non-copyleft license (Eclipse License)
- Collab opportunities: rather business-oriented community and a few lispers;

/Sentiment: Dealing with the Java stuff and lingo is unpleasant yet unavoidable. Clojure is a functional language, but since (the canonical implementation) runs on the JVM, it doesn't offer the full spectrum of what makes a functional language. Instead, it employs workarounds -- depending on the host platform. It resorts to Java interop for all kinds of (even basic) functionality, which is confusing./

*** Common Lisp (SBCL)

- Supports functional programming and logic programming, anything goes but not everything goes well;
- Covers a huge range of abstractions via libraries, e.g. pattern matching with trivia;
- Very moldable to the domain via metaprogramming (DSLs);
- Algebraic data types available, and there is also [[https://github.com/coalton-lang/coalton][Coalton]], an ML-style, internal DSL with type classes);
- Conversational programming at the running system is great for prototyping/exploration;
- Image-based: The running program can be paused, suspended, debugged, modified and continued without losing state -- this is what really sets CL apart;
- The state of a running image can be dumped and restored, but that won't work out-of-the box for a distributed system;
- Great Emacs integration, simple tooling (sly, quicklisp, asdf and roswell)
- Concurrency: [[https://github.com/mdbergmann/cl-gserver][Sento]] actor framework is the most promising; and there are [[https://github.com/dbmcclain/Lisp-Actors][Lisp-Actors]] or [[https://github.com/zkat/chanl][ChanL]]. Most concurrency facilities seem to rely directly on OS-threads instead of something like "lightweight processes", though.
- No concurrent garbage collector but stop-the-world;
- There are [[https://github.com/marcoheisig/Petalisp][Petalisp]] (data parallelism), Lparallel and [[https://github.com/marcoheisig/cl-mpi/][OpenMPI bindings]] (likely an overkill, see [[https://www.open-mpi.org][OpenMPI]]);
- SBCL is performant (Java ballpark);
- Low-level access to the language itself, plenty of optimizations;
- Problem with these "optimizations": it's required to figure out which you need and apply them, otherwise you'll miss out on performace;
- Collab opportunities: Community is diverse yet enthusiastic, fragmented, less collaborative (many one-person-projects rather than common goals realized);

/Sentiment: I'm afraid that Common Lisp could be a dead end when it comes to massive concurrency & parallelism: "[[https://www.reddit.com/r/lisp/comments/tw7zqr/what_is_a_feature_of_other_languages_that_you/][(..) high level parallelism in lisp just sucks]]". But it might be sensible to set up some benchmarks, (e.g. with Sento) before dismissing CL, because otherwise CL seems like an excellent choice for such a project./

** Specialized Programming Languages and Runtimes

While low-level languages like CUDA or OpenCL for GPU computing are well established, high-level languages for massive parallelism are a more recent invention. Up front: I'm expecting the Protoverse turning out as largely benefitting from task-parallelism rather than data-parallelism, so it might not translate well to GPUs at all. Nevertheless I list them here as part of the evaluation process.

*** Bend

- The interesting thing is the runtime HVM2, as it is based on a different model of computiation, namely "Interaction Nets" rather some partial implementation of Lambda Calculus or the Actor Model ([[https://en.wikipedia.org/wiki/Interaction_nets][Wikipedia]], [[https://www.semanticscholar.org/paper/Interaction-Combinators-Lafont/6cfe09aa6e5da6ce98077b7a048cb1badd78cc76][paper]]);
- High-level: higher-order functions, closures, unrestricted recursion, continuations;
- Untyped language -- types seem to be mere documentation, ADT syntax sugar is there to define constructor functions (see [[https://github.com/HigherOrderCO/Bend/blob/main/FEATURES.md][features]]);
- Aims to provide transparent "automatic" parallelism, no manual managment of parallelization (no thread creation, locks, mutexes, etc.);
- Compiler can generate massively parallel GPU kernels from high-level code;
- Two surface syntaxes: Python-style and ML-style;
- Still experimenal/research state;
- https://github.com/HigherOrderCO;
- [[https://discourse.julialang.org/t/bend-a-new-gpu-native-language/114440/16][Discussion in Julia forum]];
- Gained some attention, has good marketing;

*** Futhark

- Simple, ML-style, purely functional;
- "[[https://futhark-lang.org/blog/2022-04-04-futhark-is-a-low-level-language.html][Low-level]]" in certain regards;
- Has a REPL, Emacs mode and language server;
- Not meant as a general-purpose language, but to generate [[https://en.wikipedia.org/wiki/Compute_kernel][compute kernels]] used from other languages;
- [[https://futhark-book.readthedocs.io/en/latest/language.html#sequential-loops][Doesn't support recursive functions]];
- Statically typed;
- Nested data-parallelism (array language);
- Probably exactly the opposite of what's needed for the Protoverse;
- Targets [[https://futhark-lang.org/blog/2024-07-17-opencl-cuda-hip.html][CUDA, OpenCL and HIP]];
- Can compile to a Python module that internally uses PyOpenCL;
- Can compile to C code and WASM;
- [[https://github.com/zshipko/futhark-bindgen][Binding generator for OCaml]];
- Still research project;
- https://futhark-lang.org/;

