blog/engineering.protoverse.project.html
<div id="outline-container-orgdb8fca5" class="outline-4">
<h4 id="orgdb8fca5"><a href="#orgdb8fca5">JVM: Clojure</a></h4>
<div class="outline-text-4" id="text-orgdb8fca5">
<ul class="org-ul">
<li>Functional paradigm, in principle a nice and clean take on Lisp;<br></li>
<li>Recursion support: no TCO, but acknowledged by loop/recur workaround due to JVM limitations;<br></li>
<li>Interactive and live-coding, working at the running program is possible;<br></li>
<li>Great Emacs integration and prototyping ergonomics;<br></li>
<li>Has metaprogramming (hygienic), but that seems rather discouraged;<br></li>
<li>Optional type system <a href="https://github.com/typedclojure/typedclojure">Typed Clojure</a> (?); <a href="https://clojure.org/about/spec">clojure.spec</a> isn&rsquo;t a type system but for runtime validation;<br></li>
<li>Lazy sequences;<br></li>
<li>Concurrency: Several concurrency abstractions; <a href="https://www.youtube.com/watch?v=yJxFPoxqzWE">core.async</a> implements <a href="https://en.wikipedia.org/wiki/Communicating_sequential_processes">CSP-style</a> concurrency and allows channels to be passed as values; but memory is shared (unlike Erlang&rsquo;s processes);<br></li>
<li>I ran into various errors when I did naive benchmarks involving 100k concurrent computations via core.async &ldquo;go blocks&rdquo;, depending on which concurrency facility used;<br></li>
<li>Portability: Clojure targets several host platforms officially, e.g. JVM, JavaScript, CLR; and there are inofficial implementations, e.g. Erlang/Beam, but these are highly experimental;<br></li>
<li>Observability: JVM has lots of profilers and tools;<br></li>
<li>Clojure has a non-copyleft license (Eclipse License)<br></li>
<li>Collab opportunities: rather business-oriented community and a few lispers;<br></li>
</ul>

<p>
<i>Sentiment: Dealing with the Java stuff and lingo is unpleasant yet unavoidable. Clojure is a functional language, but since (the canonical implementation) runs on the JVM, it doesn&rsquo;t offer the full spectrum of what makes a functional language. Instead, it employs workarounds &#x2013; depending on the host platform. It resorts to Java interop for all kinds of (even basic) functionality, which is confusing.</i><br>
</p>
</div>
</div>
<div id="outline-container-org3d2ecf3" class="outline-4">
<h4 id="org3d2ecf3"><a href="#org3d2ecf3">Common Lisp (SBCL)</a></h4>
<div class="outline-text-4" id="text-org3d2ecf3">
<ul class="org-ul">
<li>Supports functional programming and logic programming, anything goes but not everything goes well;<br></li>
<li>Covers a huge range of abstractions via libraries, e.g. pattern matching with trivia;<br></li>
<li>Very moldable to the domain via metaprogramming (DSLs);<br></li>
<li>Algebraic data types available, and there is also <a href="https://github.com/coalton-lang/coalton">Coalton</a>, an ML-style, internal DSL with type classes);<br></li>
<li>Conversational programming at the running system is great for prototyping/exploration;<br></li>
<li>Image-based: The running program can be paused, suspended, debugged, modified and continued without losing state &#x2013; this is what really sets CL apart;<br></li>
<li>The state of a running image can be dumped and restored, but that won&rsquo;t work out-of-the box for a distributed system;<br></li>
<li>Great Emacs integration, simple tooling (sly, quicklisp, asdf and roswell)<br></li>
<li>Concurrency: <a href="https://github.com/mdbergmann/cl-gserver">Sento</a> actor framework is the most promising; and there are <a href="https://github.com/dbmcclain/Lisp-Actors">Lisp-Actors</a> or <a href="https://github.com/zkat/chanl">ChanL</a>. Most concurrency facilities seem to rely directly on OS-threads instead of something like &ldquo;lightweight processes&rdquo;, though.<br></li>
<li>No concurrent garbage collector but stop-the-world;<br></li>
<li>There are <a href="https://github.com/marcoheisig/Petalisp">Petalisp</a> (data parallelism), Lparallel and <a href="https://github.com/marcoheisig/cl-mpi/">OpenMPI bindings</a> (likely an overkill, see <a href="https://www.open-mpi.org">OpenMPI</a>);<br></li>
<li>SBCL is performant (Java ballpark);<br></li>
<li>Low-level access to the language itself, plenty of optimizations;<br></li>
<li>Problem with these &ldquo;optimizations&rdquo;: it&rsquo;s required to figure out which you need and apply them, otherwise you&rsquo;ll miss out on performace;<br></li>
<li>Collab opportunities: Community is diverse yet enthusiastic, fragmented, less collaborative (many one-person-projects rather than common goals realized);<br></li>
</ul>

<p>
<i>Sentiment: I&rsquo;m afraid that Common Lisp could be a dead end when it comes to massive concurrency &amp; parallelism: &ldquo;<a href="https://www.reddit.com/r/lisp/comments/tw7zqr/what_is_a_feature_of_other_languages_that_you/">(..) high level parallelism in lisp just sucks</a>&rdquo;. But it might be sensible to set up some benchmarks, (e.g. with Sento) before dismissing CL, because otherwise CL seems like an excellent choice for such a project.</i><br>
</p>
</div>
</div>
</div>
<div id="outline-container-org5ca357e" class="outline-3">
<h3 id="org5ca357e"><a href="#org5ca357e">Specialized Programming Languages and Runtimes</a></h3>
<div class="outline-text-3" id="text-org5ca357e">
<p>
While low-level languages like CUDA or OpenCL for GPU computing are well established, high-level languages for massive parallelism are a more recent invention. Up front: I&rsquo;m expecting the Protoverse turning out as largely benefitting from task-parallelism rather than data-parallelism, so it might not translate well to GPUs at all. Nevertheless I list them here as part of the evaluation process.<br>
</p>
</div>
<div id="outline-container-org7bf7460" class="outline-4">
<h4 id="org7bf7460"><a href="#org7bf7460">Bend</a></h4>
<div class="outline-text-4" id="text-org7bf7460">
<ul class="org-ul">
<li>The interesting thing is the runtime HVM2, as it is based on a different model of computiation, namely &ldquo;Interaction Nets&rdquo; rather some partial implementation of Lambda Calculus or the Actor Model (<a href="https://en.wikipedia.org/wiki/Interaction_nets">Wikipedia</a>, <a href="https://www.semanticscholar.org/paper/Interaction-Combinators-Lafont/6cfe09aa6e5da6ce98077b7a048cb1badd78cc76">paper</a>);<br></li>
<li>High-level: higher-order functions, closures, unrestricted recursion, continuations;<br></li>
<li>Untyped language &#x2013; types seem to be mere documentation, ADT syntax sugar is there to define constructor functions (see <a href="https://github.com/HigherOrderCO/Bend/blob/main/FEATURES.md">features</a>);<br></li>
<li>Aims to provide transparent &ldquo;automatic&rdquo; parallelism, no manual managment of parallelization (no thread creation, locks, mutexes, etc.);<br></li>
<li>Compiler can generate massively parallel GPU kernels from high-level code;<br></li>
<li>Two surface syntaxes: Python-style and ML-style;<br></li>
<li>Still experimenal/research state;<br></li>
<li><a href="https://github.com/HigherOrderCO">https://github.com/HigherOrderCO</a>;<br></li>
<li><a href="https://discourse.julialang.org/t/bend-a-new-gpu-native-language/114440/16">Discussion in Julia forum</a>;<br></li>
<li>Gained some attention, has good marketing;<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgcaa7d47" class="outline-4">
<h4 id="orgcaa7d47"><a href="#orgcaa7d47">Futhark</a></h4>
<div class="outline-text-4" id="text-orgcaa7d47">
<ul class="org-ul">
<li>Simple, ML-style, purely functional;<br></li>
<li>&ldquo;<a href="https://futhark-lang.org/blog/2022-04-04-futhark-is-a-low-level-language.html">Low-level</a>&rdquo; in certain regards;<br></li>
<li>Has a REPL, Emacs mode and language server;<br></li>
<li>Not meant as a general-purpose language, but to generate <a href="https://en.wikipedia.org/wiki/Compute_kernel">compute kernels</a> used from other languages;<br></li>
<li><a href="https://futhark-book.readthedocs.io/en/latest/language.html#sequential-loops">Doesn&rsquo;t support recursive functions</a>;<br></li>
<li>Statically typed;<br></li>
<li>Nested data-parallelism (array language);<br></li>
<li>Probably exactly the opposite of what&rsquo;s needed for the Protoverse;<br></li>
<li>Targets <a href="https://futhark-lang.org/blog/2024-07-17-opencl-cuda-hip.html">CUDA, OpenCL and HIP</a>;<br></li>
<li>Can compile to a Python module that internally uses PyOpenCL;<br></li>
<li>Can compile to C code and WASM;<br></li>
<li><a href="https://github.com/zshipko/futhark-bindgen">Binding generator for OCaml</a>;<br></li>
<li>Still research project;<br></li>
<li><a href="https://futhark-lang.org/">https://futhark-lang.org/</a>;<br></li>
</ul>
</div>
</div>
