blog/engineering.protoverse.project.org
*** Chapel

- Old-school object-oriented, not very high-level;
- Task parallism, data parallism and nested parallelism;
- Portable: orignially designed for Cray supercomputers and not with GPUs in mind, it is portable and runs on Laptops as well;
- Supports GPU programming (NVIDIA and AMD);
- What is Chapel: https://developer.hpe.com/platform/chapel/home/;

*** Lunatic (WASM runtime)

- "[[https://github.com/lunatic-solutions/lunatic][Lunatic]] is an Erlang-inspired runtime for WebAssembly";
- Supports [[https://github.com/lunatic-solutions/lunatic-rs][Rust]] and [[https://github.com/lunatic-solutions/as-lunatic][AssemblyScript]] (for now);
- Theoretically, it could support Guile with [[https://codeberg.org/spritely/hoot][Hoot]]; but that's a lot of work;
- Still experimental, and it seems abandoned anyway;

** Conclusion

The Protoverse project ventures into uncharted territory, and my gut feeling says that I should counterbalance that notion with adhering to mature, "industrial-grade" technology wherever possible.

I'm not expecting to plug libraries together, but to go through a journey of discovery and exploration, and to think through the whole process "from scratch", and the language should support that.

I'll be "re-inventing the wheel" several times, which certainly will lead to inefficient, naive implementations. In such cases it will be desirable to draw from established algorithms/libraries, after I have developed an understanding beforehand.

To me, it seems that covering much ground quickly by focussing on the model and abstractions is crucial, therefore I want to work as high-level as possible, avoiding clutter in order to free mental capacity.

*** The Finalists

I'd like to consider two languages/platforms.

What they have in common:

- Recursion is idiomatic;
- Both offer high-level concurrency facilities;
- Both are "multicore" capable without manual thread management;
- Both offer different degrees of interactivity;
- Both provide excellent interoperability with low-level code;

**** 1. BEAM (Erlang, Elixir, LFE)

The Actor Model -- available at the language level -- and Erlang's implementation thereof in conjunction with OTP makes it convenient to write concurrent programs, and the BEAM parallelizes automatically where it sees fit.

Each Erlang process has it's own stack, heap and garbage collector - and you can have a million or more of these processes in a single node. Overall, that's pretty compelling.

The BEAM is rather "infrastructure" and "industry" centred, and its languages require quite a bit of ceremony. Overall, the framework character (OTP) shines through -- it's rather "translate your problem to OTP" rather than "mold your language to fit the problem". That may be too limiting, and I don't think Elixir or even LFE are general enough for this kind of task.

Therefore it seems quite likely that I may not end up modeling Protoverse dynamics directly in the Actor Model, but rather a "Protoverse Calculus" that would have to be ported to run on the BEAM.

**** 2. Guile Scheme

Guile provides high-level concurrency facilites (fibers in conjunction with a work-stealing scheduler) and a channel-based concurrency model (like concurrent ML or Golang). Workload can be spread over multiple cores without manual thread management.

It may seem surprising, but Guile Scheme looks quite feasible as a candidate for the primary language, because it has become much more than just an "extension language" for "scripting applications written in C". For instance, it seems to handle large data structures and hefty allocation quite well -- out-of-the-box, in the REPL.

The GC (as of version 3.0.10) seems to need less attention compared to SBCL's current GC (version 2.5.10). When I did some benchmarks with deep non-tail-recursion on binary trees with ~67 million nodes (sequential), Guile turned out 1.5 times faster than SBCL, which spent 3/4 of the time in GC. With annotations and optimization, SBCL tured out a tiny bit faster that Guile.

Overall, Guile feels well balanced. Guile's focus is more on generality and expressivity. It enables exploration and provides creative freedom, which will be beneficial during the early stages. Nevertheless, there's also stuff going on with distributed computing (e.g. Spritely Goblins).
