blog/engineering.protoverse.project.html
<div id="outline-container-orgdd0eb4f" class="outline-4">
<h4 id="orgdd0eb4f"><a href="#orgdd0eb4f">Chapel</a></h4>
<div class="outline-text-4" id="text-orgdd0eb4f">
<ul class="org-ul">
<li>Old-school object-oriented, not very high-level;<br></li>
<li>Task parallism, data parallism and nested parallelism;<br></li>
<li>Portable: orignially designed for Cray supercomputers and not with GPUs in mind, it is portable and runs on Laptops as well;<br></li>
<li>Supports GPU programming (NVIDIA and AMD);<br></li>
<li>What is Chapel: <a href="https://developer.hpe.com/platform/chapel/home/">https://developer.hpe.com/platform/chapel/home/</a>;<br></li>
</ul>
</div>
</div>
<div id="outline-container-org03bd7d2" class="outline-4">
<h4 id="org03bd7d2"><a href="#org03bd7d2">Lunatic (WASM runtime)</a></h4>
<div class="outline-text-4" id="text-org03bd7d2">
<ul class="org-ul">
<li>&ldquo;<a href="https://github.com/lunatic-solutions/lunatic">Lunatic</a> is an Erlang-inspired runtime for WebAssembly&rdquo;;<br></li>
<li>Supports <a href="https://github.com/lunatic-solutions/lunatic-rs">Rust</a> and <a href="https://github.com/lunatic-solutions/as-lunatic">AssemblyScript</a> (for now);<br></li>
<li>Theoretically, it could support Guile with <a href="https://codeberg.org/spritely/hoot">Hoot</a>; but that&rsquo;s a lot of work;<br></li>
<li>Still experimental, and it seems abandoned anyway;<br></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org28bcd49" class="outline-3">
<h3 id="org28bcd49"><a href="#org28bcd49">Conclusion</a></h3>
<div class="outline-text-3" id="text-org28bcd49">
<p>
The Protoverse project ventures into uncharted territory, and my gut feeling says that I should counterbalance that notion with adhering to mature, &ldquo;industrial-grade&rdquo; technology wherever possible.<br>
</p>

<p>
I&rsquo;m not expecting to plug libraries together, but to go through a journey of discovery and exploration, and to think through the whole process &ldquo;from scratch&rdquo;, and the language should support that.<br>
</p>

<p>
I&rsquo;ll be &ldquo;re-inventing the wheel&rdquo; several times, which certainly will lead to inefficient, naive implementations. In such cases it will be desirable to draw from established algorithms/libraries, after I have developed an understanding beforehand.<br>
</p>

<p>
To me, it seems that covering much ground quickly by focussing on the model and abstractions is crucial, therefore I want to work as high-level as possible, avoiding clutter in order to free mental capacity.<br>
</p>
</div>
<div id="outline-container-org08dcdbd" class="outline-4">
<h4 id="org08dcdbd"><a href="#org08dcdbd">The Finalists</a></h4>
<div class="outline-text-4" id="text-org08dcdbd">
<p>
I&rsquo;d like to consider two languages/platforms.<br>
</p>

<p>
What they have in common:<br>
</p>

<ul class="org-ul">
<li>Recursion is idiomatic;<br></li>
<li>Both offer high-level concurrency facilities;<br></li>
<li>Both are &ldquo;multicore&rdquo; capable without manual thread management;<br></li>
<li>Both offer different degrees of interactivity;<br></li>
<li>Both provide excellent interoperability with low-level code;<br></li>
</ul>
</div>
<div id="outline-container-org7287245" class="outline-5">
<h5 id="org7287245"><a href="#org7287245">1. Guile Scheme</a></h5>
<div class="outline-text-5" id="text-org7287245">
<p>
Guile provides high-level concurrency facilites (fibers in conjunction with a work-stealing scheduler) and a channel-based concurrency model (like concurrent ML or Golang). Workload can be spread over multiple cores without manual thread management.<br>
</p>

<p>
It may seem surprising, but Guile Scheme looks quite feasible as a candidate for the primary language, because it has become much more than just an &ldquo;extension language&rdquo; for &ldquo;scripting applications written in C&rdquo;. For instance, it seems to handle large data structures and hefty allocation quite well &#x2013; out-of-the-box, in the REPL.<br>
</p>

<p>
The GC (as of version 3.0.10) seems to need less attention compared to SBCL&rsquo;s current GC (version 2.5.10). When I did some benchmarks with deep non-tail-recursion on binary trees with ~67 million nodes (sequential), Guile turned out 1.5 times faster than SBCL, which spent 3/4 of the time in GC. With annotations and optimization, SBCL tured out a tiny bit faster that Guile.<br>
</p>

<p>
Overall, Guile feels well balanced. Guile&rsquo;s focus is more on generality and expressivity. It enables exploration and provides creative freedom, which will be beneficial during the early stages. Nevertheless, there&rsquo;s also stuff going on with distributed computing (e.g. Spritely Goblins).<br>
</p>
</div>
</div>
<div id="outline-container-orga416fc0" class="outline-5">
<h5 id="orga416fc0"><a href="#orga416fc0">2. BEAM (Erlang, Elixir, LFE)</a></h5>
<div class="outline-text-5" id="text-orga416fc0">
<p>
The Actor Model &#x2013; available at the language level &#x2013; and Erlang&rsquo;s implementation thereof in conjunction with OTP makes it convenient to write concurrent programs, and the BEAM parallelizes automatically where it sees fit.<br>
</p>

<p>
Each Erlang process has it&rsquo;s own stack, heap and garbage collector - and you can have a million or more of these processes in a single node. Overall, that&rsquo;s pretty compelling.<br>
</p>

<p>
The BEAM is rather &ldquo;infrastructure&rdquo; and &ldquo;industry&rdquo; centred, and its languages require quite a bit of ceremony. Overall, the framework character (OTP) shines through &#x2013; it&rsquo;s rather &ldquo;translate your problem to OTP&rdquo; rather than &ldquo;mold your language to fit the problem&rdquo;. That may be too limiting, and I don&rsquo;t think Elixir or even LFE are general enough for this kind of task.<br>
</p>

<p>
Therefore it seems quite likely that I may not end up modeling Protoverse dynamics directly in the Actor Model, but rather a &ldquo;Protoverse Calculus&rdquo; that would have to be ported to run on the BEAM or others.<br>
</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
